# Base system
base
base-devel
linux
linux-headers
linux-firmware
intel-ucode
sudo

# Boot & filesystem
efibootmgr
grub
dosfstools
fatresize
reflector
zram-generator

# Networking
networkmanager
network-manager-applet
bluez-utils
blueman

# Audio (PipeWire)
pipewire-alsa
pipewire-pulse
wireplumber
pavucontrol
pamixer

# Wayland + Niri
cliphist
nwg-displays
rofi
swaybg
swayosd
udiskie
wl-mirror
hyprpaper
niri
sddm
qt5-graphicaleffects
wlroots0.18
swaync
swayidle
swaylock
wl-clipboard
xwayland-satellite
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xdg-desktop-portal-gnome

# Power & thermals (HP laptop)
thermald
power-profiles-daemon
cpupower
brightnessctl
usbutils

# Input & camera
libinput-tools
fprintd
v4l2loopback-dkms
v4l2loopback-utils

# File manager & utils
gnome-keyring
cups
nautilus
gvfs-afc
gvfs-mtp
gvfs-smb
unzip
zip
wget
lsof
ncdu

# Terminal & shell
btop
zoxide
kitty
fish
starship
tmux
fzf
bat
less

# Editors & dev basics
ripgrep
fd
lazygit
neovim
tree-sitter-cli
vim
git
git-delta
jq
nodejs
npm
rust
php
phpmyadmin

# Containers
docker-compose
docker

# Fonts & theming
inter-font
noto-fonts
noto-fonts-emoji
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
papirus-icon-theme

# Media
mpv
mpv-mpris
obs-studio
imv

# Office
obsidian
libreoffice-fresh

# Screen capture & desktop tools
grim
slurp
wl-screenrec
gifski
hyprpicker
zbar
translate-shell
imagemagick
