alsa-utils
android-studio
anydesk-bin
aspnet-runtime
base
base-devel
bat
blueberry
bluez-utils
brightnessctl
btop
cheese
code
cpupower
dart-sass
discord
docker
dosfstools
dotnet-sdk
efibootmgr
emote
fatresize
fish
fzf
gdm
git
git-delta
gnome-bluetooth-3.0
google-chrome
grub
gst-libav
gst-plugins-ugly
gvfs-afc
gvfs-mtp
gvfs-smb
hypridle
hyprlock
hyprpaper
imv
inter-font
jdk-openjdk
jdk21-openjdk
jq
kitty
lazygit
less
libastal-4-git
libastal-battery-git
libastal-git
libastal-io-git
libastal-meta
libastal-mpris-git
libastal-network-git
libastal-notifd-git
libastal-wireplumber-git
libinput-tools
libreoffice-fresh
linux
linux-firmware
linux-headers
linux-zen
linux-zen-headers
lsof
mpv
mpv-mpris
nano
nautilus
ncdu
neovim
network-manager-applet
networkmanager
ngrok
niri
nodejs
notion-app-electron
noto-fonts
noto-fonts-emoji
npm
obs-studio
pamixer
papirus-icon-theme
pavucontrol
phpmyadmin
pipewire-alsa
pipewire-pulse
postman-bin
power-profiles-daemon
qbittorrent
reflector
rofi
rust
starship
sudo
swayidle
swaylock
swaync
thermald
tmux
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
unzip
usbutils
v4l2loopback-dkms
v4l2loopback-utils
vim
waybar
wget
wireplumber
wl-clipboard
wlroots0.18
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xwayland-satellite
yay
zen-browser-bin
zip
zram-generator
